#language: ru

Функционал: Тестирование сайта https://dev.n7lanit.ru/

  Предыстория:
  1. По ссылке перейти на сайт - открывается страница по умолчанию
  2. Перейти на страницу Категории
  3. Перейти на страницу Пользователи
  4. Выполнить поиск пользователя из Предусловия


  Структура сценария:   тестируем сайт Ланит
    Пусть открыт браузер и введен адрес "<адрес>"
    И переходим в раздел Категории
    И переходим в раздел Пользователи
    И выполняем поиск пользователя из предусловия
    Тогда пробуем выполнить регистрацию с пустыми полями
    Тогда пробуем выполнить регистрацию существующем пользователем
    И пробуем зарегестрировать нового пользователя
    Тогда завершаем тест





    Примеры:
       |          адрес        |
       |https://dev.n7lanit.ru/|

